Repository: astappiev/woocommerce-wayforpay-gateway
Catalog: languages/wp-wayforpay-gateway-*.po
Languages: ru_ru, uk

source: Enable/Disable
ru_ru: Включить или выключить
uk: Увімкнути або вимкнути

source: Return URL
ru_ru: Страница возврата
uk: Сторінка повернення

source: Select Page
ru_ru: Выберите страницу
uk: Виберіть сторінку

source: or specify
ru_ru: или укажите
uk: або вкажіть

source: Payment gateway
ru_ru: Платежный шлюз
uk: Платіжний шлюз

source: Thank you for your order, you will now be redirected to the WayForPay payment page.
ru_ru: Спасибо за ваш заказ, сейчас вы будете перенаправлены на страницу оплаты WayForPay.
uk: Дякуємо за ваше замовлення, зараз ви будете перенаправлені на сторінку оплати WayForPay.

source: An error has occurred during payment. Please contact us to ensure your order has submitted.
ru_ru: Во время оплаты произошла ошибка. Свяжитесь с нами, чтобы убедиться, что ваш заказ отправлен.
uk: Під час оплати сталася помилка. Зв’яжіться з нами, щоб переконатися, що ваше замовлення відправлено.

source: An error has occurred during payment. Merchant data is incorrect.
ru_ru: Во время оплаты произошла ошибка. Данные продавца неправильные.
uk: Під час оплати сталася помилка. Дані продавця неправильні.

source: An error has occurred during payment. Signature is not valid.
ru_ru: Во время оплаты произошла ошибка. Подпись недействительна.
uk: Під час оплати сталася помилка. Підпис недійсний.

source: WooCommerce WayForPay Gateway
ru_ru: Платежный шлюз WayForPay для WooCommerce
uk: Платіжний шлюз WayForPay для WooCommerce

source: Dev team WayForPay, Oleh Astappiev
ru_ru: Команда разработчиков WayForPay, Oleh Astappiev
uk: Команда розробників WayForPay, Oleh Astappiev

source: Enable WayForPay Payment Engine
ru_ru: Включить платежную систему WayForPay
uk: Увімкнути платіжну систему WayForPay

source: Title
ru_ru: Название платежного метода
uk: Назва платіжного методу

source: This controls the title which user sees during checkout.
ru_ru: Название платежного метода, которое может прочитать пользователь во время оплаты.
uk: Назва платіжного методу, яку може прочитати користувач під час оплати.

source: Description
ru_ru: Описание платежного метода
uk: Опис платіжного методу

source: Pay securely via the WayForPay Payment Engine.
ru_ru: Оплачивайте безопасно через платежную систему WayForPay.
uk: Сплачуйте безпечно через платіжну систему WayForPay.

source: This controls the description which user sees during checkout.
ru_ru: Дополнительный комментарий об этом методе оплаты, который может прочитать пользователь во время оплаты.
uk: Додатковий коментар про цей метод оплати, який може прочитати користувач під час оплати.

source: Seller identifier. This value is assigned to you by WayForPay.
ru_ru: Идентификатор продавца. Это значение присваивается вам системой WayForPay.
uk: Ідентифікатор продавця. Це значення присвоюється вам системою WayForPay.

source: Signature secret key. This value is assigned to you by WayForPay.
ru_ru: Секретный ключ продавца. Это значение присваивается вам системой WayForPay.
uk: Секретний ключ продавця. Це значення присвоюється вам системою WayForPay.

source: Display Logo
ru_ru: Отображение логотипа
uk: Відображення логотипу

source: No logo
ru_ru: Без логотипа
uk: Без логотипу

source: WayForPay Logo
ru_ru: Логотип WayForPay
uk: Логотип WayForPay

source: Payment Processors Logos
ru_ru: Логотипы платежных систем
uk: Логотипи платіжних систем

source: Determines which logo is shown near this payment method on checkout.
ru_ru: Определяет, какой логотип отображается возле этого способа оплаты на кассе.
uk: Визначає, який логотип відображається біля цього способу оплати на касі.

source: The value is controlled by the %s constant.
ru_ru: Значение контролируется константой %s.
uk: Значення контролюється константою %s.

source: Transaction updated, current status: %s
ru_ru: Транзакция обновлена, текущий статус: %s
uk: Транзакцію оновлено, поточний статус: %s

source: Payment successful: %1$s %2$s.
ru_ru: Платеж выполнен: %1$s %2$s.
uk: Платіж виконано: %1$s %2$s.

source: Refunded %1$s %2$s.
ru_ru: Возвращено %1$s из %2$s.
uk: Повернуто %1$s з %2$s.

source: Payment expired.
ru_ru: Срок оплаты истек.
uk: Термін оплати закінчився.

source: Payment failed: %1$s - %2$s.
ru_ru: Платеж не прошел: %1$s - %2$s.
uk: Платіж не пройшов: %1$s - %2$s.

source: The page where the user will be directed after payment.
ru_ru: Страница, куда будет попадать пользователь после оплаты.
uk: Сторінка, куди буде потрапляти користувач після оплати.

source: The URL of the page where the user will be directed after payment.
ru_ru: Ссылка на страницу, куда будет перенаправлен пользователь после оплаты.
uk: Посилання на сторінку, куди буде потрапляти користувач після оплати.

source: Accept card payments, Apple Pay and Google Pay via WayForPay payment gateway.
ru_ru: Принимайте платежи по картам, Apple Pay и Google Pay через платежный шлюз WayForPay.
uk: Приймайте платежі карткою, Apple Pay та Google Pay через платіжний шлюз WayForPay.

source: Pay with card, Apple Pay, Google Pay
ru_ru: Оплата картой, Apple Pay, Google Pay
uk: Оплачуйте карткою, Apple Pay, Google Pay

source: Enable test merchant for Administrators
ru_ru: Использовать тестовый MerchantID для администраторов
uk: Увімкнути тестовий MerchantID для адміністраторів

source: When enabled, the test merchant will be used for admins. You on your own risk.
ru_ru: Если эта опция включена, тестовый MerchantID будет использоваться для администраторов (все оплаты автоматически возвращаются). Вы делаете это на свой страх и риск.
uk: Якщо цю опцію ввімкнено, тестовий MerchantID використовуватиметься для адміністраторів (усі оплати автоматично повертаються). Ви робите це на свій страх і ризик.

source: A test merchant was used for this transaction (no money received)!
ru_ru: Для этой транзакции был использован тестовый MerchantID (деньги не были получены)!
uk: Для цієї транзакції було використано тестовий MerchantID (гроші не були отримані)!

source: An error has occurred during redirect, if it persists, please contact us.
ru_ru: Во время перенаправления произошла ошибка, если она не устраняется, пожалуйста, свяжитесь с нами.
uk: Під час перенаправлення сталася помилка, якщо вона не усувається, будь ласка, зв'яжіться з нами.
